app/controllers/api/users_controller.rb

  def create # sign up

    @user = User.new(user_params)
    #
    if @user.save
---
INSERT INTO "users" ("username", "email", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"