app/models/user.rb

  def reset_token! #dangerous because of save!

    self.session_token = User.generate_token
    self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "Kexyap1XCO8cHaHMFHq_qQ"], ["updated_at", "2019-07-30 18:23:43.693134"], ["id", 7]]